labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
  #include "stm32l1xx.h"
#include "Settings.h"

#ifndef _USE_BT
#define _USE_BT
#endif

#if (_USE_BT == 1)

#include "Pinouts.h"
#include "Shortcodes.h"
#include "Variables.h"
#include "Functions.h"
#include "Conversions.h"


#include "HC05_SHORTCODES.h"
#include "HAL_HC05.h"
#include "LIB_HC05.h"

HAL_HC05 hc05;



/****************************************************************
*FUNCTION NAME:PoweronReset
*FUNCTION     :Switch reset //details refer datasheet of CC1101/CC1100//
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void LIB_HC05::PoweronReset(void)
{
    hc05.hardReset();
    
}

/****************************************************************
*FUNCTION NAME:RegConfigSettings
*FUNCTION     :HC05 register config //details refer datasheet of ST7586S//
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void LIB_HC05::RegConfigSettings(void)
{
  setAtMode();
  restoreDefaults(200);

}

/****************************************************************
*FUNCTION NAME:Init
*FUNCTION     :HC05 initialization
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void LIB_HC05::Init()
{
  hc05.gpioInit();
  hc05.uartInit(HC05_BAUDRATE_AT);
  PoweronReset();

  RegConfigSettings();
}
/****************************************************************
*FUNCTION NAME:setATMode
*FUNCTION     :set device to respond to AT Command Mode
*INPUT        :none
*OUTPUT       :none
****************************************************************/
 void LIB_HC05::setAtMode(void)
 { 
   GPIO_ResetBits(HC05_GPIO_EN, HC05_PIN_EN);      //  EN pulled to LOW
   delay_ms(100);
   GPIO_SetBits(HC05_GPIO_KEY, HC05_PIN_KEY);      //  KEY PIN HIGH TO ON COMMAND AT MODE
    
   delay_ms(300);
    
   GPIO_SetBits(HC05_GPIO_EN, HC05_PIN_EN);       // EN floating to HIGH
   delay_ms(1000);   
 }
 /****************************************************************
*FUNCTION NAME:setDataMode
*FUNCTION     :set device to respond to Data Mode
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void LIB_HC05::setDataMode(void)
{
  GPIO_ResetBits(HC05_GPIO_EN, HC05_PIN_EN);      //  POWER OFF
  delay_ms(100);
  GPIO_ResetBits(HC05_GPIO_KEY, HC05_PIN_KEY);    //  KEY PIN LOW TO ON DATA MODE

  delay_ms(300);

  GPIO_SetBits(HC05_GPIO_EN, HC05_PIN_EN);         //POWER ON
  delay_ms(1000);   

}

/****************************************************************
*FUNCTION NAME:testCommand
*FUNCTION     :HC05 initialization
*INPUT        :none
*OUTPUT       :none
****************************************************************/
void LIB_HC05::testCommand(void)
{
  setAtMode();
  hc05.writeString("AT\r\n");
  
  getVersion(Sim80x.UsartRxBuffer, sizeof(Sim80x.UsartRxBuffer), 200);
  
  hc05.sendAtCommand("AT+VERSION?\r\n", 200, 2, "+VERSION:", "OK\r\n");
                     
}
/****************************************************************
*FUNCTION NAME:probe
*FUNCTION     :probe
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::probe(unsigned long timeout)
{
  startOperation(timeout);
  hc05.writeCommand(0);
  return hc05.readOperationResult();
}


/****************************************************************
*FUNCTION NAME:softReset
*FUNCTION     :Reset on command
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::softReset(unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(reset_cmd, "RESET");
  return (hc05.simpleCommand(AT_RESET, 0, timeout));
}

/****************************************************************
*FUNCTION NAME:getVersion
*FUNCTION     :getVersion // check with bharath
*INPUT        :buffer,buffer_size,timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getVersion(char *buffer, size_t buffer_size, unsigned long timeout)
{
  startOperation(timeout);

  if (!buffer || buffer_size <= 1)
    return false;

  //PGM_STRING_MAPPED_TO_RAM(command, "VERSION?");
  hc05.writeCommand(AT_CMD_GET_VERSION);

  /* Response should look like "+VERSION:2.0-20100601" */
  char response[30];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+VERSION:");
  
  const char *version = hc05.readResponseWithPrefix(
     response, sizeof(response), AT_RESP_VERSION);
 
  if (m_errCode != HC05_OK)
    return false;

  if (!version)
  {
    *buffer = 0;
    return hc05.readOperationResult() && false;
  }

  snprintf(buffer, buffer_size, "%s", version);
  return hc05.readOperationResult();
}


/****************************************************************
*FUNCTION NAME:restoreDefaults
*FUNCTION     :restoreDefaults// check with bharath
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::restoreDefaults(unsigned long timeout)
{
  
  //PGM_STRING_MAPPED_TO_RAM(command, "ORGL");
  return hc05.simpleCommand(AT_ORGL, 0, timeout);
}


/****************************************************************
*FUNCTION NAME:getAddress
*FUNCTION     :getAddress// check with bharath
*INPUT        :address:BluetoothAddress,timeout
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::getAddress(BluetoothAddress &address, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command_name, "ADDR");
  return hc05.readAddressWithCommand(address, AT_ADDR, timeout);
}


/****************************************************************
*FUNCTION NAME:getName
*FUNCTION     :get Name from external device// check with bharath
*INPUT        :buffer,timeout
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::getName(char *buffer, unsigned long timeout)
{
  startOperation(timeout);

  if (!buffer)
  {
    m_errCode = HC05_FAIL;
    return false;
  }

