labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
  if (!params_part)
    return hc05.readOperationResult() && false;

  inquiry_interval = atol(params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  inquiry_duration = atol(++params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  paging_interval = atol(++params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  paging_duration = atol(++params_part);

  return hc05.readOperationResult();
}


/****************************************************************
*FUNCTION NAME:setInquiryAndPagingParams
*FUNCTION     :setInquiryAndPagingParams// check with bharath
*INPUT        :inquiry_interval, inquiry_duration, paging_interval, paging_duratio,timeout
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::setInquiryAndPagingParams(
  uint16_t inquiry_interval, uint16_t inquiry_duration,
  uint16_t paging_interval, uint16_t paging_duration, unsigned long timeout)
{
  char params_str[40];
  
  //PGM_STRING_MAPPED_TO_RAM(format, "%u,%u,%u,%u");
  snprintf(params_str, sizeof(params_str), "%u,%u,%u,%u",
    inquiry_interval, inquiry_duration, paging_interval, paging_duration);

  //PGM_STRING_MAPPED_TO_RAM(command, "IPSCAN=");
  return hc05.simpleCommand(AT_CMD_SET_IPSCAN, params_str, timeout);
}


/****************************************************************
*FUNCTION NAME:getSniffParams
*FUNCTION     :getSniffParams// check with bharath
*INPUT        :max_time, min_time, retry_interval, sniff_timeout, timeout
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::getSniffParams(uint16_t &max_time, uint16_t &min_time,
  uint16_t &retry_interval, uint16_t &sniff_timeout, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "SNIFF?");
  hc05.writeCommand(AT_CMD_GET_SNIFF);

  char response[40];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+SNIFF:");
  char *params_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_SNIFF);

  if (m_errCode != HC05_OK)
    return false;

  if (!params_part)
    return hc05.readOperationResult() && false;

  max_time = atol(params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  min_time = atol(++params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  retry_interval = atol(++params_part);
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  sniff_timeout = atol(++params_part);

  return hc05.readOperationResult();
}


/****************************************************************
*FUNCTION NAME:setSniffParams
*FUNCTION     :set Sniff Parameter// check with bharath
*INPUT        :max_time, min_time, retry_interval, sniff_timeout, timeout
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::setSniffParams(uint16_t max_time, uint16_t min_time,
  uint16_t retry_interval, uint16_t sniff_timeout, unsigned long timeout)
{
  char params_str[40];
  //PGM_STRING_MAPPED_TO_RAM(format, "%u,%u,%u,%u");
  snprintf(params_str, sizeof(params_str), "%u,%u,%u,%u",
    max_time, min_time, retry_interval, sniff_timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "SNIFF=");
  return hc05.simpleCommand(AT_CMD_SET_SNIFF, params_str, timeout);
}


/****************************************************************
*FUNCTION NAME:enterSniffMode
*FUNCTION     :enterSniffMode// check with bharath
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::enterSniffMode(unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command, "ENSNIFF");
  return hc05.simpleCommand(AT_CMD_ENSNIFF, 0, timeout);
}


/****************************************************************
*FUNCTION NAME:exitSniffMode
*FUNCTION     :exitSniffMode// check with bharath
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::exitSniffMode(unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command, "EXSNIFF");
  return hc05.simpleCommand(AT_CMD_EXSNIFF, 0, timeout);
}


/****************************************************************
*FUNCTION NAME:getSecurityAndEncryption
*FUNCTION     :getSecurityAndEncryption // check with bharath
*INPUT        :Security,encryption,timeout
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::getSecurityAndEncryption(HC05_Security &security,
  HC05_Encryption &encryption, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "SENM?");
  hc05.writeCommand(AT_CMD_GET_SENM);

  char response[20];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+SENM:");
  char *params_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_SENM);

  if (m_errCode != HC05_OK)
    return false;

  if (!params_part)
    return hc05.readOperationResult() && false;

  security = static_cast<HC05_Security>(atol(params_part));
  params_part = strchrnul(params_part, ',');

  if (*params_part != ',')
    return hc05.readOperationResult() && false;

  encryption = static_cast<HC05_Encryption>(atol(++params_part));

  return hc05.readOperationResult();
}


/****************************************************************
*FUNCTION NAME:getVersion
*FUNCTION     :getVersion// check with bharath
*INPUT        :address : Bluetoothaddress,timeout
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::setSecurityAndEncryption(HC05_Security security,
  HC05_Encryption encryption, unsigned long timeout)
{
  char params_str[10];
  //PGM_STRING_MAPPED_TO_RAM(format, "%u,%u");
  snprintf(params_str, sizeof(params_str), "%u,%u", security, encryption);

  //PGM_STRING_MAPPED_TO_RAM(command, "SENM=");
  return hc05.simpleCommand(AT_CMD_SET_SENM, params_str, timeout);
}


/****************************************************************
*FUNCTION NAME:deleteDeviceFromList
*FUNCTION     :deleteDeviceFromList// check with bharath
*INPUT        :buffer,buffer_size,timeout
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::deleteDeviceFromList(
    const BluetoothAddress &address, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command_name, "RMSAD");
  return hc05.writeAddressWithCommand(address, AT_RMSAD, timeout);
}


/****************************************************************
*FUNCTION NAME:deleteAllDevicesFromList
*FUNCTION     :deleteAllDevicesFromList// check with bharath
*INPUT        :timeout
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::deleteAllDevicesFromList(unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command, "RMAAD");
  return hc05.simpleCommand(AT_RMAAD, 0, timeout);
}


/****************************************************************
*FUNCTION NAME:getVersion
*FUNCTION     :getVersion// check with bharath
*INPUT        :address : Bluetoothaddress,timeout
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::findDeviceInList(
  const BluetoothAddress &address, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command_name, "FSAD");
  return hc05.writeAddressWithCommand(address, AT_FSAD, timeout);
}


/****************************************************************
*FUNCTION NAME:countDevicesInList
*FUNCTION     :countDevicesInList  // check with bharath
*INPUT        :device_count,timeout
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::countDevicesInList(uint8_t &device_count, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "ADCN?");
  hc05.writeCommand(AT_CMD_GET_ADCN);

  char response[20];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+ADCN:");
  const char *count_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_ADCN);

  if (m_errCode != HC05_OK)
    return false;

  if (!count_part)
    return hc05.readOperationResult() && false;

  device_count = atol(count_part);

  return hc05.readOperationResult();
}


/****************************************************************
*FUNCTION NAME:getLastAuthenticatedDevice
*FUNCTION     :getLastAuthenticatedDevice  // check with bharath
*INPUT        :address : BluetoothAddress,timeout;
*OUTPUT       :bool
****************************************************************/

bool LIB_HC05::getLastAuthenticatedDevice(
  BluetoothAddress &address, unsigned long timeout)
{
  //PGM_STRING_MAPPED_TO_RAM(command_name, "MRAD");
  return hc05.readAddressWithCommand(address, AT_MRAD, timeout);
}


/****************************************************************
*FUNCTION NAME:getState
*FUNCTION     :getState// check with bharath
*INPUT        :state,timeout
*OUTPUT       :bool
****************************************************************/

